In [3]:
from utils.tushare_router import TushareRouter
router = TushareRouter("../src/utils/tushare_registry.json")
df_basic = router.fetch(fields=["name","exchange","curr_type","list_date"], ts_code="600519.SH")

08-21 18:35:01 | INFO    | utils.tushare_router:__init__ | ✅ 已加载字段路由注册表：../src/utils/tushare_registry.json

In [4]:
df_basic

  curr_type exchange list_date  name    ts_code
0       CNY      SSE  20010827  贵州茅台  600519.SH

In [9]:
df_px = router.fetch_price(ts_code="600519.SH", start_date="20240101", end_date="20240630",
                           fields=["ts_code","name","trade_date","open","close"], adj="qfq")

In [10]:
df_px

       ts_code trade_date     open    close
0    600519.SH   20240628  1480.00  1467.39
1    600519.SH   20240627  1492.00  1490.49
2    600519.SH   20240626  1480.00  1489.22
3    600519.SH   20240625  1477.09  1486.74
4    600519.SH   20240624  1423.07  1476.62
..         ...        ...      ...      ...
112  600519.SH   20240108  1627.37  1610.70
113  600519.SH   20240105  1627.69  1629.68
114  600519.SH   20240104  1658.72  1635.20
115  600519.SH   20240103  1647.07  1659.70
116  600519.SH   20240102  1680.27  1650.89

[117 rows x 4 columns]